perf/scenarios/all.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
  processor: "helpers.js"

  pool: 75
  
  phases:
    - name: Warm-up (poca carga)
      duration: 30
      arrivalRate: 2
    - name: Ramp-up (aumentando carga)
      duration: 60
      arrivalRate: 2
      rampTo: 20
    - name: Soak (carga constante alta)
      duration: 180
      arrivalRate: 20
    - name: Spike (pico repentino)
      duration: 30
      arrivalRate: 100
    - name: Ramp-down (descenso)
      duration: 60
      arrivalRate: 20
      rampTo: 2
      
scenarios:
  - name: Exchange all-phases
    flow:
      - function: "setRandomExchange"
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: "1"
            counterAccountId: "2"
            baseAmount: "{{ baseAmount }}"